3-simpleFoamWA/3-simpleFoamWA/testCase/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 14.855;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 14.855;
        value           uniform 14.855;
    }

    upperWall
    {
    	type            zeroGradient;
        //type            fixedValue;
        //type            epsilonWallFunction;
        //value           uniform 0.0001;
    }

    lowerWall
    {
    	type            zeroGradient;
        //type            fixedValue;
        //type            epsilonWallFunction;
        //value           uniform 0.0001;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
