3-simpleFoamWA/3-simpleFoamWA/testCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|nuTilda|f|v2)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        smoother        GaussSeidel;
        relTol          0.1;
    }

    "(k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        smoother        GaussSeidel;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      false;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7; 
        nuTilda         0.7;
        k               0.7;
        epsilon         0.7;
    }
}


// ************************************************************************* //
