3-simpleFoamWA/3-simpleFoamWA/testCase/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

foamCleanTutorials
runApplication blockMesh
touch case.foam
runApplication simpleFoamWA

#------------------------------------------------------------------------------
